<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 缓存配置为复合类型
    'type'   => 'complex',
    'default' => [
        // 文件缓存
        'type'   => 'File',
        // 缓存保存目录
        'path'   => '../runtime/cache',
        // 缓存前缀
        'prefix' => 'aoogi',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],
    'redis' => [
        // redis缓存
        'type'   => 'redis',
        // 缓存主机地址
        'host'   => '127.0.0.1',
        // 缓存前缀
        'prefix' => 'aoogi',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],

];
